<a href="https://colab.research.google.com/github/evanthacker/960-Grid-System/blob/master/1_2_14_Groupby_in_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 7. Groupby in Pandas

In [ ]:
import pandas as pd
pd.__version__

'1.4.4'

In [ ]:
# Create a data frame
my_df1=pd.DataFrame({
    'Product_ID':[101,102,103,104,105,106],
    'Food_Product':['Cakes','Biscuits','Fruit','Beverages','Cakes','Beverages'],
    'Brand':['Baskin Robbins','Blue Riband','Peach','Horlicks','Mars Muffin','Mirinda'],
    'Sales':[5000, 8000, 7600, 5500, 6500, 9000],
    'Profit': [55000, 67000, 89000, 78000, 55000, 90000]
})
print(my_df1)

   Product_ID Food_Product           Brand  Sales  Profit
0         101        Cakes  Baskin Robbins   5000   55000
1         102     Biscuits     Blue Riband   8000   67000
2         103        Fruit           Peach   7600   89000
3         104    Beverages        Horlicks   5500   78000
4         105        Cakes     Mars Muffin   6500   55000
5         106    Beverages         Mirinda   9000   90000

#### Number of Unique Column Values Per Group

In [ ]:
my_df1.groupby("Food_Product")["Sales"].nunique().to_frame()

              Sales
Food_Product
Beverages         2
Biscuits          1
Cakes             2
Fruit             1

### Sort Groupby Results

Turn the groupby object into a regular dataframe by calling .to_frame().reset_index()

In [ ]:
my_df1.groupby('Food_Product')['Sales'].sum().to_frame().reset_index()

  Food_Product  Sales
0    Beverages  14500
1     Biscuits   8000
2        Cakes  11500
3        Fruit   7600

In [ ]:
my_df1.groupby('Food_Product')['Sales'].sum().to_frame().reset_index().sort_values(by='Sales')

  Food_Product  Sales
3        Fruit   7600
1     Biscuits   8000
2        Cakes  11500
0    Beverages  14500

### Heirarchical Indices Created by Groupby

In [ ]:
my_df1.groupby('Food_Product').agg({'Sales':['min','max','mean','sum']})

             Sales
               min   max    mean    sum
Food_Product
Beverages     5500  9000  7250.0  14500
Biscuits      8000  8000  8000.0   8000
Cakes         5000  6500  5750.0  11500
Fruit         7600  7600  7600.0   7600